// lib/data/health_questions.dart

final List<Map<String, dynamic>> healthQuestions = [
  {
    "id": "sugar",
    "question": "1. चीनी का सेवन कम करना - आप कितनी बार मीठे खाद्य पदार्थ या पेय लेते हैं?",
    "options": ["कभी नहीं", "शायद ही कभी", "कभी-कभी", "अक्सर", "बहुत अधिक"],
    "scores": [10, 8, 5, 2, 0]
  },
  {
    "id": "snacking",
    "question": "2. नाश्ता कम करना - आप कितनी बार भोजन के बीच नाश्ता करते हैं?",
    "options": ["कभी नहीं", "शायद ही कभी", "कभी-कभी", "अक्सर", "बहुत अधिक"],
    "scores": [10, 8, 5, 2, 0]
  },
  {
    "id": "lateDinner",
    "question": "3. देर रात का भोजन टालना - क्या आप रात में देर से भोजन करने से बचते हैं?",
    "options": ["हमेशा", " अधिकांश समय", "कभी-कभी", "शायद ही कभी", "कभी नहीं"],
    "scores": [10, 8, 5, 2, 0]
  },
  {
    "id": "physicalActivity",
    "question": "4. नियमित शारीरिक गतिविधि - आप कितनी बार शारीरिक गतिविधि में भाग लेते हैं?",
    "options": ["प्रतिदिन", "सप्ताह में 4-6 बार", "सप्ताह में 2-3 बार", "सप्ताह में एक बार", "कभी नहीं"],
    "scores": [10, 8, 5, 2, 0]
  },
  {
    "id": "alcohol",
    "question": "5. अल्कोहल का सेवन - आप कितनी बार अल्कोहल का सेवन करते हैं?",
    "options": ["कभी नहीं", "शायद ही कभी", "कभी-कभी", "अक्सर", "बहुत अधिक"],
    "scores": [0, -2, -5, -8, -10]
  },
  {
    "id": "smoking",
    "question": "6. सिगरेट धूम्रपान - आप कितनी बार सिगरेट पीते हैं?",
    "options": ["कभी नहीं", "शायद ही कभी", "कभी-कभी", "अक्सर", "बहुत अधिक"],
    "scores": [0, -2, -5, -8, -10]
  },
  {
    "id": "tobacco",
    "question": "7. तम्बाकू का सेवन - क्या आप तम्बाकू का सेवन करते हैं?",
    "options": ["कभी नहीं", "शायद ही कभी", "कभी-कभी", "अक्सर", "बहुत अधिक"],
    "scores": [0, -2, -5, -8, -10]
  },
];